

factors = ('A','B','C','E','F','G','H','I','L','M','N','O','Q1','Q2','Q3','Q4')


###################################################### Level 1 ##############################################

level_1_factors = ('اعتبار تست' , 'موضع گیری فرد')
level_1_criteria = {'اعتبار تست' : {0 :'معتبر!' , 32 :'با احتیاط!' , 58 :'غیر معتبر!' }  , 'موضع گیری فرد' : { 'good_factors' :(('+C' , '+H' , '-L' , '-O' , '+Q3', '-Q4') ,'FG') , 'bad_factors':(('-C' , '-H' , '+L' , '+O' , '-Q3', '+Q4') ,'FB') }  }


###################################################### Level 2 ##############################################

level_2_factors = ('سطح اطمینان بالا' , 'سطح اطمینان پایین')
level_2_keys = ('high_compatiblity' , 'low_compatiblity' )
level_2_criteria = {'سطح اطمینان بالا': { 'high_compatiblity' : (('+C' , '+Q3') ,'!سطح سازگاری بالا') , 'low_compatiblity' : (('-C' , '-Q3'), '!سطح سازگاری پایین') } ,
                                'سطح اطمینان پایین': { 'high_compatiblity' : (('+C' , '+Q3', '+G' ), '!سطح سازگاری بالا') ,'low_compatiblity' : (('-C' , '-Q3', '-G' ), '!سطح سازگاری پایین') }
                                }


###################################################### Level 3 ##############################################
level_3_factors = ('first_order' , 'second_order')

first_order_factors = ('high_reliable_report' , 'low_reliable_report')


first_order_dict = { 
        '+A':
        ('.از بودن با دیگران لذت می‌برد.' , 'بودن با دیگران برایش موضوعیت دارد' , 'اجتماع خواهی آن‌ها همراه با احساسات هست؛ گاهی شاد و گاهی غمگین','ارتقاء شغلی بیشتری دارند','هیجان‌های خود را به راحتی ابراز می‌کنند.','در مشکلات، از دیگران کمک می‌گیرند.','پیوستن به فعالیت‌های گروهی')

         ,
        '-A':
        ('بودن با دیگران موضوعیت ندارد؛ تعامل می‌کنند ولی بعد از جدایی از افراد، به آن‌ها فکر نمی‌کنند.','در برخورد با دیگران خوددار، پنهان‌کار و فاقد احساس هستند.','در مشاغل انفرادی موفق‌تر هستند.','هیچ شخصی مورد علاقه آنها نیست.','تنهایی را ترجیح می‌دهند.')
    
         ,
        '+B':
        ('از هوش خودشان خوب استفاده می‌کنند.','مهارت حل مسئله خوبی دارند.','پشتکار خوبی دارند.','افراد باهوش، دارای هوش انتزاعی و استدلالی.')

        ,
        '-B':
        ('دارای تفکر عینی، خشک و سطحی' , 'پشتکار کم دارند ','حل مسئله خوبی ندارند.','قدرت عقلانی کمتری دارند.')

        ,
        '+C':
        ('قدرت تصمیم‌گیری بالایی دارد.','قدرت مدیریت هیجانات بالایی دارد و از ثبات هیجانی برخوردار است.','با مسائل شناختی‌تر برخورد می‌کند.','در سازش با موقعیت‌های اجتماعی موفق‌تر است.','به عنوان فردی مورد اعتماد شناخته می‌شود و در روابط با دیگران ثابت‌قدم هست.','بر زندگی خود کنترل دارد. ','تصور از خود بالایی دارند و رویارویی با واقعیت‌ّها، برایشان مشکل نیست.')

        ,
        '-C':
        ('قدرت تصمیم‌گیری پایینی دارند.','قدرت مدیریت هیجانات و احساسات آن‌ها کم هست و ثبات هیجانی خوبی ندارند.','در سازش با موقعیت‌های اجتماعی موفق نیستند.','از موقعیت خود و خانواده و .. ناراضی هستند.','در روابط خودو ثابت قدم نیستند و زود رنگ عوض می‌کنند.','وقتی کارها خراب می‌شود، فکر می‌کنند که نمی‌توانند با آن‌ها کنار بیایند','از مسئولیت طفره می‌روند','اغلب با مشاجره‌های بین‌فردی درگیر هستند.','')

        ,
        '+E':
        ('می‌تواند به خوبی از دیگران برای رسیدن به اهداف خود یا جمعی هستند.','مستعد رفتار زورگویی و کارهای ضداجتماعی هست.','کسانی را که زیر سلطه آن‌ها نمی‌روند را طرد می‌کنند. ','اغلب دوست دارند که دیگران تحسین‌شان کنند.')

        ,
        '-E':
        ('فردی مهربان و بیشتر متکی به خود هستند.','تبعیت‌جو و کم‌رو هستند.','از خواسته‌های خود گذشت می‌کنند.','نسبت به دیگران ملاحظه‌کار هستند.','از تعارض پرهیز می‌کنند و معمولا پرخاش‌های خود را درون‌ریزی می‌کنند.')
        
        ,
        '+F':
        ('انرژی بالایی دارند و دائما در حال فعالیت هستند.','در مسائل جنسی گرم و داغ هستند.','معمولا برون‌گرا هستند.','علاقه‌مند به زندگی اجتماعی، پرحرف و همراه با شوخی‌ مخصوصا شوخی‌های مبتذل.','در مهمانی‌ها بشاش، فعال و پرحرف هستند.','اغلب محبوب هستند و قدرت رهبری نیز دارند.')

        ,
        '-F':
        ('انرژی پایینی دارند و مقداری در کارها حالت واررفتگی دارند.','معمولا درون‌گرا هستند.','دیگران هستند که آن‌ها به سمت خود می‌کشانند.','انعطاف ناپذیر هستند و با موقعیت‌های بسیار کند سازش می‌کنند.','قابل اعتماد هستند.','جدی و غمگین هستند.','امکان دارد بدبین و بیش‌ از اندازه محتاط باشند.')

        ,
        '+G':
        ('سخت‌گیر هستند و راحت یک موضوع را رها نمی‌کنند.','واجد احساس مسئولیت، در روابط خویش محتاط','فردی با وجدان، اخلاقی، شایسته، مطیع قوانین جامعه و وظیفه‌شناس','خود را از لحاظ اخلاقی درست می‌دانند.','دیگران را دوست دارند تجزیه و تحلیل کنند.','دقت و نظم افراطی دارند.','رهبران گروه معمولا از این افراد هستند.')

        
        ,
        '-G':
        ('آسان‌گیر هستند','خطاهای زیادی دارند و ممکن است موضوعات ذهنی آن‌ها را تغییر یابد.','فرامن ضعیفی دارند و کنترل درونی ضعیفی دارند.','به درخواست اجتماعی پاسخ نمی‌ٔدهند و پرتوقع هستند.','فردی ناپایدار و متلون هستند.','ممکن است جامعه‌ستیز باشند. قوانین را هم راحت زیر پا می‌گذارند.','چون آزادانه و بدون قید و شرط فکر می‌کنند، ممکن است مسائل را به گونه موثری حل کنند.','معمولا خودشان قانون هستند.')

        ,
        '+H':
        ('جسور و شجاع هستند.','با دیگران هستند ولی دیگران را نمی‌بینند.','در کنار دیگری هستند ولی این سبب کنترل آن‌ّها نمی‌شود.','دنبال هیجان در روابط خود با محیط هستند.','میل دارد بالاتر از دیگران باشد.','حساسیت کمتری به امر و نهی‌های اجتماع دارند.','در تعامل اجتماعی راحت هستند و با دیگران بودن، برایشان آسان است، علائم خطر را نادیده می‌گیرند')

        
        ,
        '-H':
        ('خجالتی، کم‌رو، بازدار و ملاحظه‌کار هستند، روابطش با محیط سرد هست.','خود را به واسطه دیگران کنترل می‌کنند.','رغبتش به جنس مخالف، تقلیل پیدا می‌کند. ','آغاز گفتگو برایشان سخت است.','به طور معمول احساس کهتری می‌کنند.','اینکه در جمع درست صحبت کنند و .. برایشان مهم است و سبب اضطراب می‌شود.','معاشرت با دو نفر یا سه نفر را به گروه ترجیح می‌دهند.')


        ,
        '+I':
        ('حساسیت هیجانی بالایی دارند لذا ممکن است غم، اضطراب و .. بیشتر رنج‌شان ببرد.','دوست دارند که زندگی اجتماعی داشته باشند و سعی در جلب توجه دیگران دارند.','افرادی همدل و نسبت به احساسات دیگران حساسند.','قضاوت‌های آنها بر سلایق شخصی استوار هست.','در حد افراطی ممکن است تندمزاج، غیرواقع‌بین و نیازمند توجه هست.','دارای علائق ظریف هستند و غیر افراد ظریف را دوست ندارند.','خیال‌پردازی می‌کنند و به جنبه‌های عملی فکر نمی‌کنند.')

        ,
        '-I':
        ('نسبت به محرک‌های بیرونی، حساسیت چندانی ندارند.','کمتر تمایلات شخصی خود را دنبال می‌کنند.','واقعیات دنیای ملموس را می‌پذیرد.','در زندگی خود دارای نگرش عملی، عینی و معقول‌اند.','تظاهرات هیجانی را سرکوب می‌کنند.','نسبت به احساسات خودشان، حساس نیستند.')

        
        ,
        '+L':
        ('خشن، بی‌اعتنا، بدگمان و بددل هستند.','احتمال شخصیت ضداجتماعی وجود دارد. ','خود را واجد رفتارهای صحیح می‌دانند.','تمایل به حسادت دارند.','فردی است که تمایل زیادی به زندگی درونی و روانی دارند.')

        ,
        '-L':
        ('علاقه‌مند به جامعه و دیگران هستند؛ ','شاد و زودجوش هستند.','افراد سازش‌پذیرش، به دور از حسادت، باز و شکیبا هستند.','احساس خوبی درباره خود دارند.','گرایش به آرمان‌گرایی در این افراد هست','انتظار دارند مساوات طلبانه و وفادارانه رفتار شودو.')

        ,
        '+M':
        ('اهل حرف زدن و کولی‌بازی هستند.','افرادی خلاق، غیرسنتی، خودانگیخته و درون‌وابسته هستند','در دنیای اندیشه و خیال زندگی می‌کنند و لذا با واقعیات فاصله دارند.','زندگی خود را دنبال می‌کنند بدون آنکه به قرارداد و خواسته‌های زندگی جمعی توجه کنند.')

        ,
        '-M':
        ('علاقه‌مند به زندگی اجتماعی و دیگران','خود را تابع قراردادهای اجتماعی می‌دانند.','به جزئیات عملی زندگی توجه می‌کنند.','آنان را به عنوان افرادی آگاه، معقول، سنتی و استوار می‌شناسند.','افراد غیرتخیلی و عملی و عینی هستند.')

        ,
        '+N':
        ('نشانگر ظرافت فرد است و آداب را رعایت می‌کند.','با پنبه سر می‌برد.','برای حریم شخصی خود ارزش قائل هستند، در روابط با دیگران سرد و سخت هستند.','نسبت به مسائل اجتماعی هشیار هستند.','مانند سیاست‌مداران کارکشته، تعاملشان حساب‌گرانه است.')

        ,
        '-N':
        ('علاقه‌مند به دیگران و در روابط‌شان آسان‌گیر هستند.','افرادی باز، اصیل و صادق هستند.','با مردم به گرمی حرف می‌زنند.','افراد کم مهارت و فاقد ذوق هنری هستند.')

        ,
        '+O':
        ('احساس گناه زیادی دارد؛ اضطراب بالایی دارند.','از خود انتظار بالایی دارند و خیلی از خود انتقاد می‌کنند. ','خود تنبیه‌گر هستند و مستعد افسردگی هستند.')

        ,
        '-O':
        ('فردی آسوده و غیر حساس هستند','اعتماد به نفس بالایی دارند.','دوست ندارند توسط رسومات جامعه و دیگران محدود شوند','کنترل سوپراگو در آن‌ها به اندازه کافی قوی می‌باشد')
        
        ,
        '+Q1':
        ('این افراد دوست دارند همه چیز را تجربه و تغییر دهند.','ابتکار عمل دارند ولی از نظرات دیگران استفاده نمی‌کنند.','این افراد خود را بیشتر درون‌گرا نشان می‌دهند.','نوآوری را دوست دارند و از یک حالت ثابت خسته می‌شوند.')

        ,
        '-Q1':
        ('به عقائد سنتی اعتقاد دارند و معمولا از نظرات دیگران استفاده می‌کنند.','با تغییر مخالفت می‌کند و آن را به تعویق می‌اندازد.')

        ,
        '+Q2':
        ('خودشان تصمیم می‌گیرند و متکی به تصمیمات شخصی هستند.','نظرات دیگران در آن‌ها تاثیرگذار نیست.','فرد مصمم و مسلط بر خود است','ترجیح می‌ٔدهند خودشان کار کنند.','دارای نوعی درون‌گرایی سالم که بعضا به خودپسندی و خودبسندی کشیده می‌شود.')

        ,
        '+Q3':
        ('تصویر روشنی از خود دارند؛ نقاط مثبت و منفی خود را خوب می‌دانند.','کنترل خوبی بر هیجان‌ها، رفتار دارند.','در کارهای هوش بالا و دقت بالایی دارند البته مقداری هم لجباز هستند.','به نظم و سازماندهی علاقه دارند.','تقویم زمانی خوبی دارند و عملکرد بالایی دارند.','عادت‌هایشان تا اندازه‌ای جنبه وسواسی دارد.','افراد خشک هستند و در شرائط قابل پیش‌بینی راحت‌تر هستند.','معمولا تمایل به ریاضیات دارند.')

        ,
        '-Q3':
        ('به نظم و دقت بی‌توجه هستند.','تصویر روشنی از خود ندارند و معمولا اضطراب بالایی دارند.','کارها را به شانس و تصادف می‌گذارند.','کمتر با برنامه‌ریزی کار می‌کنند و بیشتر خودانگیخته کار می‌کنند.','دیگران به آن‌ها تنبل، بی‌نظم و .. می‌گویند.','از امیال خود پیروی می‌کنند.')

        ,
        '+Q4':
        ('معمولا کام نایافته، مضطرب و تحریک پذیر هستند. ','کشاننده‌های قوی و ناپایدار دارند.','پرشور، پرهیجان، گرایش به جنس مخالف هستند. مثلا با لذت غذا می‌خورند.')

        ,
        '-Q4':
        ('آرام و ریلکس هستند.','این افراد با زندگی و شرایط، راحت و شکیبا هستند.','گاهی بی‌خیال هم هستند.')
    
        }


second_order_dict = { 
        'A':[  
                
                {'factors' : {'+A' , '-B'}  , 'sentences' : 'فردی خوش‌بین – احتمال فریب خوردگی وجود دارد – تشخیص پیچیدگی زندگی مشکل دارد '  } ,
                {'factors' : {'+A' , '+E'}  , 'sentences' :   'از نظر کلامی قوی -فردی متقاعد کننده ' },
                {'factors' : {'+A' , '+F'}  , 'sentences' :   'گروه‌گرا، برون‌گرا، کم حیا، زود صمیمی می‌شوند، کلمات رکیک هم استفاده می‌کنند. ' },
                {'factors' : {'+A' , '-I'}  , 'sentences' :   'در عین گرم‌بودن، همدلی پایین دارند. (دوستی خاله خرسه) ' },
                {'factors' : {'+A' , '+I' , '-H'}  , 'sentences' :   'گرم و تودل برو ' },
                {'factors' : {'-A' , '-E'}  , 'sentences' :   'طردشدگی، ترس از ارتباط جدید، خشم با توانایی کنترل پایین، احتمال سوءاستفاده ' },
                {'factors' : {'-A' , '+Q2'}  , 'sentences' :   'اهل شکایت، بینش پایین ' },
                {'factors' : {'-A' , '+E'}  , 'sentences' :   'یکدنده، سلطه‌گر و بی‌تفاوت به دیگران ' },
                {'factors' : {'-A' , '+H'}  , 'sentences' :   'سرد، جسور، روابط وسیع دارند ولی این روابط سطحی ' },
                {'factors' : {'-A' , '-H'}  , 'sentences' :   'خجالتی، قابل اطمینان در دوستی، فقدان مدیریت، سلطه‌پذیر، نیازمند به مصاحبت ' },
                {'factors' : {'-A' , '+I'}  , 'sentences' :   'مهربان، هم‌احساس با دیگران، دیرجوش و محتاط ' },
                {'factors' : {'-A' , '+N'}  , 'sentences' :   'آشفتگی در ارتباط با دیگران، مدیریت نکردن روابط خود ' }
         
        ]

        ,'B':[
                
                {'factors' : {'+B' , '+E','+Q3'}  , 'sentences' :   'پرخاشگری عقلانی دارند، دیر کشف می‌شوند و لذا در دراز مدت دوستان خود را از دست می‌دهند، احتمال اختلال شخصیت در آن‌ها وجود دارد. ' },
                {'factors' : {'+B' , '+M'}  , 'sentences' :   'خلاقیت بالا دارند، فعالیت‌های عقلانی بالایی دارند ' },
                {'factors' : {'+B' , '+I','+Q3'}  , 'sentences' :   'پتانسیل خلاقیت، کنترل خوب بر فعالیت‌های خیالی و فانتزی ' },
                {'factors' : {'-B' , '+H'}  , 'sentences' :   'ماجراجو و پرسروصدا، زمخت و پراشتباه، بدون میل به اصلاح (اشتباهات تکراری دارد)، کارهای غیر عقلایی ' },
                {'factors' : {'-B' , '+C'}  , 'sentences' :   'تصمیم می‌گیرد ولی همه جوانب را نمی‌تواند بسنجد ' }
         
        ]
        , 'C':[
        
                {'factors' : {'+C' , '+H'}  , 'sentences' :   'جسور، حادثه‌جو البته با مدیریت در حوادث ' },
                {'factors' : {'+C' , '-L'}  , 'sentences' :   'اعتمادکننده و پذیرای شرائط (مناسب برای درمان) ' },
                {'factors' : {'+C' , '-Q4'}  , 'sentences' :   'آرام و خوددار، کام‌یافته و غیرعقده‌ای ' },
                {'factors' : {'+C' , '+L','-O'}  , 'sentences' :   'آرام و با اعتماد به نفس بالا البته با حالت‌های دفاعی ' },
                {'factors' : {'-C' , '+L', '-O'}  , 'sentences' :   'خود‌پنداره کاذب، پر از تعارض و افکار تحریف‌شده، مشکوک به بالینی ' },
                {'factors' : {'-C' , '-F'}  , 'sentences' :   'جزمی‌نگر، متعصب، مبهم، بدون موضع‌گیری واضح و نظرات بی‌سر و ته ' },
                {'factors' : {'-C' , '-F', '-Q3'}  , 'sentences' :   'دامنه فکری محدود، ترس و وحشت در روابط اجتماعی، تلاش مداوم بر متقاعد کردن دیگران، عصبانیت زودهنگام، تکانه‌‌ای ' },
                {'factors' : {'-C' , '-E', '+Q4'}  , 'sentences' :   'منفعل ولی تندمزاج ' },
                {'factors' : {'-C' , '-Q3'}  , 'sentences' :   'قدرت سازگاری پایین ' }
                
        ]

        , 'E':[
                {'factors' : {'+E' , '-A'}  , 'sentences' :   'انعطاف‌ناپذیر و سخت، مقداری پرخاشگر‌، ناتوان در موقعیت‌ّهای مهم ' },  
                {'factors' : {'+E' , '+C'}  , 'sentences' :   'احتمال پرخاشگری در این افراد هست، دیگران را خوب مدیریت می‌کنند ' },  
                {'factors' : {'+E' , '+A'}  , 'sentences' :   'روابط اجتماعی قوی، کنایه‌زن، قوانین قدیمی را تغییر می‌ٔدهند ' },  
                {'factors' : {'+E' , '+F'}  , 'sentences' :   'بی‌خیال ولی مشتاق، پرانرژی، بی‌توجه به نظر دیگران، ابتدا مشتاق انجام کار هستند ولی به خاطر عدم تمرکز ادامه نمی‌ٔدهند، احتمال اختلال‌های شخصیت در این افراد وجود دارد ' },  
                {'factors' : {'+E' , '-G'}  , 'sentences' :   'معمولا افراطی و اسراف‌کار هستند، ملاحظه دیگران را نمی‌کند، اهل غیبت و تهمت ' },  
                {'factors' : {'+E' , '+H'}  , 'sentences' :   'جسور، اهل کارهای پرخطر، اهل‌ تصمیمات هیجانی ' },  
                {'factors' : {'+E' , '+H','+C'}  , 'sentences' :   'جسور، اهل کارهای پرخطر، اهل‌ تصمیمات هیجانی با مهار و کنترل بیشتر ' },  
                {'factors' : {'+E' , '+H','-C'}  , 'sentences' :   'جسور، اهل کارهای پرخطر، اهل‌ تصمیمات هیجانی با مهار و کنترل ضعیف ' },  
                {'factors' : {'+E' , '-Q1'}  , 'sentences' :   'پرخاشگر ' },  
                {'factors' : {'+E' , '+Q1'}  , 'sentences' :   'انتقاد‌پذیر، آماده تغییر و تجربه کردن، ' },  
                {'factors' : {'+E' , '+M'}  , 'sentences' :   'فرد با عصبانیت سر و صدا راه می‌اندازد ' },  
                {'factors' : {'+E' , '+L'}  , 'sentences' :   'سو‌ظن بالایی دارند، برای دیگران نقشه می‌کشند و احتمال پارانوئید بودن دارند، انعطاف ندارند ' },  
                {'factors' : {'+E' , '-N'}  , 'sentences' :   'صادق و سر‌به هوا، بی‌ریا، جذب‌کننده، راحت به اشتباهات خود اعتراف می‌کنند (اگر B هم پایین باشد، شرائط بدتر می‌شود) ' },  
                {'factors' : {'-E' , '+H'}  , 'sentences' :   'رفتارهای بچه‌گانه و لوث‌بازی دارند، احتمال هیستریک بودن هم دارند ' },  
                {'factors' : {'-E' , '+G'}  , 'sentences' :   'باوجدان، اخلاقی و پایبند ' },  
                {'factors' : {'-E' , '+L'}  , 'sentences' :   'خشم خود را پنهان می‌کنند و احتمال بروز خشم زیاد هم دارند ' },  
                {'factors' : {'-E' , '-L'}  , 'sentences' :   'احتمال پرخاش بالا ' },  
                {'factors' : {'-E' , '-Q1'}  , 'sentences' :   'محافظه‌کار و سنتی‌ هستند ' },  
                {'factors' : {'-E' , '+Q1'}  , 'sentences' :   'رفتارهای دیکتاتوری دارند ' },  
                {'factors' : {'-E' , '-F', '-A'}  , 'sentences' :   'منفی‌باف هستند احتمال افسردگی، اجتناب از تعارض به جای حل آن ' }


        ]
        , 'F':[
        
                {'factors' : {'+F' , '-I', '-Q2'}  , 'sentences' :   'خوش‌برخورد، دورنمای خوب، کمی سرد، حمایت طلب، اگر با او مدارا نشود رابطه را قطع می‌کند ' },  
                {'factors' : {'+F' , '-Q3','+H'}  , 'sentences' :   'تکانشی هستند، مسئولیت نمی‌گیرند و کارها را ناتمام می‌گذارند، تکلیف نمی‌دهند ' },  
                {'factors' : {'+F' , '-O','-Q2'}  , 'sentences' :   'وابسته به گروه، کنترل این‌ها سخت هست ' },  
                {'factors' : {'+F' , '-C'}  , 'sentences' :   'مشکل مهار رفتاری در این افراد داریم، رفتارهای اتوماتیک خیلی دارند ' },  
                {'factors' : {'+F' , '+A'}  , 'sentences' :   'کنار آمدن با آن‌ها راحت هست، خون‌گرم، آسان‌گیر، بی‌ریا البته کمی خودخواه هستند ' },  
                {'factors' : {'+F' , '+E'}  , 'sentences' :   'لج‌باز هستند و لج آدم را درمی‌آورند، پرخاشگر، در مردها کتک‌کاری احتمال دارد، اهل‌توجیه ' },  
                {'factors' : {'+F' , '+H'}  , 'sentences' :   'بدون‌ بازداری و ملاحظه، پرخطر، انرژی بالا، آسیب‌پذیر در برابر سرزنش، موفق در روابط جنسی (البته در مسائل جنسی شکست و سرزنش داغونشان می‌کنند) ' },  
                {'factors' : {'+F' , '-O'}  , 'sentences' :   'تکانشی هستند ' },  
                {'factors' : {'-F' , '-A','-C'}  , 'sentences' :   'آدم تلخی است و قابل تحمل نیستند ' },  
                {'factors' : {'-F' , '-A','-C'}  , 'sentences' :   'آدم تلخی است و قابل تحمل نیستند البته این‌ها مقداری حالت شیرینی دارند. ' },  
                {'factors' : {'-F' , '-A'}  , 'sentences' :   'خودمهارگری بالا، فاصله می‌گیرند از دیگران، به دیگران بی‌اعتنا هستند، خرده‌گیر و غرزننده ' },  
                {'factors' : {'-F' , '+B'}  , 'sentences' :   'تنوع علائق زیادی ندارند، کارها را خوب پیش می‌برند ' },  
                {'factors' : {'-F' , '-E'}  , 'sentences' :   'کارمند و دانشجوی خوبی هستند، دلسوز هستند و سربه زیر، کارها را خوب پیش می‌برند، مستعد برای کارهای روان‌درمانی و مددکاری ' },  
                {'factors' : {'-F' , '-H'}  , 'sentences' :   'آدم حساس، حساس به تهدید و انتقاد، خجالتی ' },  
                {'factors' : {'-F' , '+N'}  , 'sentences' :   'غرغرو، محاسبه‌گر، حواس جمع، اهل دعوا نیستند، جایی غر می‌زند که به خواسته‌اش‌برسد و این موقعیت را خوب تشخیص می‌ٔدهد ' },  
                {'factors' : {'-F' , '-M'}  , 'sentences' :   'تمرکز بر واقعیت در این‌ افراد زیاد است ' },  
                {'factors' : {'-F' , '+O'}  , 'sentences' :   'واررفته، ناموفق در روابط جنسی، انرژی پایین دارند و مستعد افسردگی هستند ' },  
                {'factors' : {'-F' , '+Q2'}  , 'sentences' :   ' متکی به خود و مقداری متکبر از جهت شخصیتی نه اخلاقی ' } 
                    
        
        ]
        , 'G':[
                {'factors' : {'+G' ,'+Q3'}  , 'sentences' :   'اراده قوی دارند، سخت‌گیر هستند، احتمال وسواس در این افراد هست ' },  
                {'factors' : {'+G' ,'-Q1'}  , 'sentences' :   'سنتی و خیلی محافظه‌کار هستند ' },  
                {'factors' : {'+G' ,'-E'}  , 'sentences' :   'متواضع، پذیرش خوب، مهربان هستند و تبعیت‌جو، می‌تواند بهترین مراجع برای درمان باشد ' },  
                {'factors' : {'+G' ,'+O'}  , 'sentences' :   'خودسرزنش‌گر منفی هستنند ' },  
                {'factors' : {'+G' ,'+C','+F','+Q3'}  , 'sentences' :   'با انرژی، شور و شوق زیاد، البته با خودمهارگری کنترل می‌کنند ' },  
                {'factors' : {'-G' ,'+O'}  , 'sentences' :   'بی‌قید و بند (البته نه بی‌اخلاق)، انعطاف‌پذیر ' },  
                {'factors' : {'-G' ,'-O'}  , 'sentences' :   'خطا دارند و زود توبه می‌کنند، سخت پایبند می‌شوند، می‌فهمند اشتباه کرده‌اند ولی نمی‌توانند کنترل کنند، چارچوب شکن و قانون شکن هستند مخصوصا در اخلاقیات ' },  
                {'factors' : {'-G' ,'+Q1'}  , 'sentences' :   'روشن‌فکر، اهل تجربه‌های جدید، حرف‌های نوآورانه و جدید و منطقی می‌زند ' },  
                {'factors' : {'-G' ,'-Q3'}  , 'sentences' :   'سنت‌گرا ولی سهل‌گیر هست، احتمال تکانشی عمل کردن را دارد، موضع‌گیری‌های مشخص و روشنی ندارد ' },  
                {'factors' : {'-G' ,'+F'}  , 'sentences' :   'شتاب‌زده عمل می‌کنند، اشتباهات تکراری دارند ' },  
                {'factors' : {'-G' ,'+N'}  , 'sentences' :   'تکانشی عمل می‌کند، تکالیف را انجام نمی‌دهد، کارهای نیمه‌تمام زیاد دارد ' },  
                {'factors' : {'-G' ,'+C','+Q4'}  , 'sentences' :   'باوجدان، پخته ولی کمی‌ اضطرابی ' },  
                {'factors' : {'-G' ,'-F','+O'}  , 'sentences' :   'احتمال افسردگی در این افراد هست، تست بک گرفته شود ' } 
               
        ]
        , 'H':[
                {'factors' : {'+H' ,'-F'}  , 'sentences' :   'اهل‌ فرافکنی، اینها رفتارهای افسردگی نشان می‌ٔدهند ولی افسرده نیستند، باید دقت شود ماسک افسردگی می‌زنند ' },  
                {'factors' : {'+H' ,'-O'}  , 'sentences' :   'متین و ساکت هستند، مطمئن به خود و محکم ' },  
                {'factors' : {'+H' ,'+Q1'}  , 'sentences' :   'خرده‌گیر در روابط، غرغرو ' },  
                {'factors' : {'+H' ,'-Q4'}  , 'sentences' :   'آرام و امیدوار ' },  
                {'factors' : {'+H' ,'+F','-B'}  , 'sentences' :   'مستعد تصادف، توجه به هشدارهای خطر نمی‌کند ' },  
                {'factors' : {'+H' ,'+F','+I'}  , 'sentences' :   'شخصیت پویا ' },  
                {'factors' : {'-H' ,'+Q2'}  , 'sentences' :   'مبتکر و خودکفا ' },  
                {'factors' : {'-H' ,'+O'}  , 'sentences' :   'شکاک، خودسرزنشگر، نگران و ناپایدار ' },  
                {'factors' : {'-H' ,'-C'}  , 'sentences' :   'احساساتی، ناپایدار و کم‌ثبات ' },  
                {'factors' : {'-H' ,'-F'}  , 'sentences' :   'جدی، تودار، انتقادپذیر، آدم‌های میانه‌رو و معتدل ' },  
                {'factors' : {'-H' ,'-A'}  , 'sentences' :   'جدی، تودار، انتقادپذیر، آدم‌های میانه‌رو و معتدل، فاصله‌جو و کناره‌گیر از اجتماع ' },  
                {'factors' : {'-H' ,'-E'}  , 'sentences' :   'متواضع و مطیع ' },  
                {'factors' : {'-H' ,'+F'}  , 'sentences' :   'خجالتی و نپخته ' }  
               
        ]
        , 'I':[
                {'factors' : {'+I' ,'+M','+Q1'}  , 'sentences' :   'هنرمند و خلاق ' },  
                {'factors' : {'+I' ,'-M'}  , 'sentences' :   'مهربان، حساس، خودبینشی پایین ' },  
                {'factors' : {'+I' ,'-L','+E'}  , 'sentences' :   'سلطه همراه با شفقت و دلسوزی ' },  
                {'factors' : {'+I' ,'-L','-E'}  , 'sentences' :   'پذیرش و انطباق فرد با نگرانی‌ّهای زیادی و دلسوزی برای دیگران ' },  
                {'factors' : {'-I' ,'+A'}  , 'sentences' :   'برون‌گرا، خیرخواه، تبادلات اجتماعی سطحی، همدلی و احساس پایینی دارند و احتمالا تشریفاتی هستند ' },  
                {'factors' : {'-I' ,'-A'}  , 'sentences' :   'سرد، غیرحساس و مانند دیوار و سنگ عمل می‌کنند ' },  
                {'factors' : {'-I' ,'-E'}  , 'sentences' :   'منفعل و غیر فعال ' },  
                {'factors' : {'-I' ,'+O'}  , 'sentences' :   'خجالتی، احساس گناه زیادی دارند، سرکوبی زیادی دارند، از مسائل فرار می‌کنند ' },  
                
        ]
        , 'L':[
                {'factors' : {'+L' ,'+O'}  , 'sentences' :   'خود سرزنشگر هستند، شکاک و ناایمن، انکار زیاد دارند و لذا فرافکنی کم ' },  
                {'factors' : {'+L' ,'+B'}  , 'sentences' :   'فرافکنی، حسادت همراه نقشه‌هایی که به سمت دیگران سوق دهد ' },  
                {'factors' : {'+L' ,'+E'}  , 'sentences' :   'پرخاشگر، کنترل‌گر، اهل دعوا و کتک‌کاری، لج‌باز و قاطع، رقابت‌جو، عاشق (دوست داشتن بی‌قید و شرط) نمی‌شوند، احتمال محرومیت از عشق در گذشته دارند ' },  
                {'factors' : {'+L' ,'-C'}  , 'sentences' :   'ثبات پایین هیجانی، احساسی و تحت تاثیر احساسات هستند، زود به هم می‌ریزند، بهم‌ریختگی عاطفی ' },  
                {'factors' : {'+L' ,'-O'}  , 'sentences' :   'آدم‌های گستاخی هستند ولی عزت نفس پایین هم دارند ' },  
                {'factors' : {'+L' ,'-I','+E'}  , 'sentences' :   'پرخاشگر، خصمانه و در تلاش غلبه و سلطه ' },  
                {'factors' : {'-L' ,'-E'}  , 'sentences' :   'متواضع ' },  
                {'factors' : {'-L' ,'-Q4'}  , 'sentences' :   'خونسرد و امیدوار ' },  
                {'factors' : {'-L' ,'+M'}  , 'sentences' :   'نوآور و منصف ' }
                
        ]
        , 'M':[
                {'factors' : {'+M' ,'+Anxiety'}  , 'sentences' :   'مستعد تصادف و خطر ' }
        ]  
        
        , 'N':[
                {'factors' : {'+N' ,'+A'}  , 'sentences' :   'مستعد تصادف و خطر ' },
                {'factors' : {'+N' ,'-E'}  , 'sentences' :   'ابراز غیر مستقیم پرخاشگری ' },
                {'factors' : {'+N' ,'-G'}  , 'sentences' :   'برداشت اجتماعی اولیه خوب ' }       
        ]

        , 'O':[
                {'factors' : {'+O' ,'+Q2'}  , 'sentences' :   'انزوا به خاطر حس بی‌ارزشی ' },
                {'factors' : {'+O' ,'-Q3'}  , 'sentences' :   'تنش درونی بین احساس گناه و تکانشگری (احساسات مبنی بر فقدان کنترل خود) ' },
                {'factors' : {'+O' ,'+Q3'}  , 'sentences' :   'اضطراب محدود، خجالت و شرم ناشی از احساس شکست در برابر انتظارات خویش ' } , 
                {'factors' : {'-O' ,'-Q4','-Q3'}  , 'sentences' :   'خودمحور، در ظاهر درهم و برهم، تمایل دارند ریلکس باشند، نسبت به خود خیلی سهل‌گیر هستند ' }      
        ]
        
        , 'Q1':[
        
                {'factors' : {'+Q1' ,'+B','+E','+I'}  , 'sentences' :   'خصومت مستدل و عقلانی‌شده ' },
                {'factors' : {'+Q1' ,'+B','+E','+M','+Q3'}  , 'sentences' :   'پتانسیل برای خلاقیت دارند ' },
                {'factors' : {'+Q1' ,'+E','-A','-O','+Q4'}  , 'sentences' :   'تسلط پرخاشگرانه بدون توجه به نگرانی دیگران ' },
                {'factors' : {'+Q1' ,'+M','+I'}  , 'sentences' :   'هنرمند و خلاق ' },
                {'factors' : {'-Q1' ,'+G','-M','+Q3'}  , 'sentences' :   'به شغل‌های عرفی و مرسوم علاقه دارند ' }
   
        ]
        , 'Q2':[
                {'factors' : {'+Q2' ,'-A'}  , 'sentences' :   'کناره‌گیر، در روابط عقب‌نشینی می‌کند، ارتباط کمی دارد و دلبستگی کم دارند ' },
                {'factors' : {'+Q2' ,'+L'}  , 'sentences' :   'بی‌اعتمادی و رد توصیه و پند دیگران، ' },
                {'factors' : {'+Q2' ,'+O'}  , 'sentences' :   'انزوا به خاطر حس بی‌ارزشی ' },
                {'factors' : {'-Q2' ,'-H','-F','-A'}  , 'sentences' :   'درون‌گرا امّا وابسته ' },
                {'factors' : {'-Q2' ,'+A'}  , 'sentences' :   'مراقبت و رفتار دوستانه، نیاز بالا به بازخورد و حمایت اجتماعی ' },
                {'factors' : {'-Q2' ,'+E'}  , 'sentences' :   'بین وابستگی و سلطه،‌ تنش دارند ' },
                {'factors' : {'-Q2' ,'+L'}  , 'sentences' :   'بین وابستگی و بیش‌تیز‌بینی (گوش بزنگی بالا)، تعارض درونی از نوع اجتنابی-گرایشی، سوظن بالا در مقابل نیازمندی‌های اجتماعی ' }
        ]
        
        , 'Q3':[
                {'factors' : {'+Q3' ,'+F','+C','+G'}  , 'sentences' :   'انرژی و شور و شوقی که با خودمهارگری تعدیل شده ' },
                {'factors' : {'+Q3' ,'-G'}  , 'sentences' :   'خود منضبط امّا فرصت‌طلب ' },
                {'factors' : {'+Q3' ,'+O'}  , 'sentences' :   'اضطراب محدود، خجالت و شرم ناشی از احساس شکست در برابر انتظارات خویش ' },
                {'factors' : {'-Q3' ,'-H','-E','-C'}  , 'sentences' :   'مهارت‌های ضعیف در حل مسئله، قادر نبودن در انجام و شروع کار ' },
                {'factors' : {'-Q3' ,'+E','-C','+F','-G'}  , 'sentences' :   'تکانشگر، پرخاشگر و احتمالا هنگام تهدید شدن خشونت آمیز ' },
                {'factors' : {'-Q3' ,'-O','-Q4'}  , 'sentences' :   'خودمحور، در ظاهر درهم و برهم، تمایل دارند ریلکس باشند، نسبت به خود خیلی سهل‌گیر هستند ' },
                {'factors' : {'-Q3' ,'+O'}  , 'sentences' :   'تنش درونی بین احساس گناه و تکانشگری (احساسات مبنی بر فقدان کنترل خود) ' }
        ]
        , 'Q4':[
                {'factors' : {'+Q4' ,'-C','-E'}  , 'sentences' :   'ناآرام و عصبی، مطیع و فرمانبردار، منفعل و تندمزاج ' },
                {'factors' : {'+Q4' ,'-A','-O','+E','+Q1'}  , 'sentences' :   'تسلط پرخاشگرانه بدون توجه به نگرانی دیگران ' },
                {'factors' : {'-Q4' ,'-Q3','-O'}  , 'sentences' :   'خودمحور، در ظاهر درهم و برهم، تمایل دارند ریلکس باشند، نسبت به خود خیلی سهل‌گیر هستند ' },
        ]
                

}

# level_3_criteria = { 'high_reliable': first_order_dict  ,
#         'low_reliable': first_order_dict }


